# Titanic - Logistic Regression

![title](image/Titanic_wreck.jpg)

## Kaggle Data Set

In [1]:
# https://www.kaggle.com/c/titanic/data

## Exploratory Data Analysis

In [8]:
import pandas as pd

In [20]:
train_data = pd.read_csv("train.csv")
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [12]:
train_data.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [13]:
test_data = pd.read_csv("test.csv")
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [14]:
test_data.count()

PassengerId    418
Pclass         418
Name           418
Sex            418
Age            332
SibSp          418
Parch          418
Ticket         418
Fare           417
Cabin           91
Embarked       418
dtype: int64

## Fill the NaN values in the age column

In [18]:
train_data['Age'].fillna(value = round(train_data['Age'].mean()), inplace = True)
train_data['Age'][0:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    30.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [21]:
test_data['Age'].fillna(value = round(test_data['Age'].mean()), inplace = True)
test_data['Age'][0:10]

0    34.5
1    47.0
2    62.0
3    27.0
4    22.0
5    14.0
6    30.0
7    26.0
8    18.0
9    21.0
Name: Age, dtype: float64

## Create a first class column from Pclass

In [22]:
train_data['FirstClass'] = train_data['Pclass'].apply(lambda x: 1 if x == 1 else 0)
train_data['FirstClass'][0:10]

0    0
1    1
2    0
3    1
4    0
5    0
6    1
7    0
8    0
9    0
Name: FirstClass, dtype: int64

In [23]:
test_data['FirstClass'] = test_data['Pclass'].apply(lambda x: 1 if x == 1 else 0)
test_data['FirstClass'][0:10]

0    0
1    0
2    0
3    0
4    0
5    0
6    0
7    0
8    0
9    0
Name: FirstClass, dtype: int64

## Create a second class column from Pclass

In [24]:
train_data['SeconClass'] = train_data['Pclass'].apply(lambda x: 1 if x == 2 else 0)
train_data['SeconClass'][0:10]

0    0
1    0
2    0
3    0
4    0
5    0
6    0
7    0
8    0
9    1
Name: SeconClass, dtype: int64

In [25]:
test_data['SeconClass'] = test_data['Pclass'].apply(lambda x: 1 if x == 2 else 0)
test_data['SeconClass'][0:10]

0    0
1    0
2    1
3    0
4    0
5    0
6    0
7    1
8    0
9    0
Name: SeconClass, dtype: int64